import React from 'react';
import {Col, Collapse, Typography} from "antd";

const {Title, Text} = Typography;
const {Panel} = Collapse;

const QAPanel = () => {
    return <Col xs={{span: 24, offset: 0}} sm={{span: 9, offset: 1}} md={{span: 9, offset: 1}}
                lg={{span: 9, offset: 1}}>
        <Title>Запитання та відповіді про (COVID-19)</Title>
        <Collapse defaultActiveKey={['']}>
            <Panel header="Що таке коронавірус?" key="1">
                <p>Коронавіруси - це велика родина вірусів, які можуть спричинити захворювання у тварин або
                     люди. У людини відомо, що кілька коронавірусів викликають дихання
                     інфекції
                     від застуди до більш важких захворювань, таких як Близький Схід
                     Дихальні
                     Синдром (MERS) та важкий гострий респіраторний синдром (ГРВІ). Зовсім недавно
                     виявлений коронавірус викликає коронавірусну хворобу COVID-19.</p>
            </Panel>
            <Panel header="Які симптоми COVID-19?" key="2">
                <p>Найпоширеніші симптоми COVID-19 - лихоманка, втома та сухий кашель. Деякі
                     у пацієнтів можуть бути болі і болі, закладеність носа, нежить, біль у горлі або
                     діарея. Ці симптоми, як правило, легкі і починаються поступово. Деякі люди
                     стати
                     інфіковані, але не проявляють жодних симптомів і не відчувають себе погано. Більшість людей
                     (о
                     80%) одужують від захворювання, не потребуючи спеціального лікування. Приблизно 1 з
                     кожні 6 людей, які отримують COVID-19, тяжко хворіють і розвиваються труднощі
                     дихання. Люди похилого віку та ті, хто має основні медичні проблеми, люблять високий рівень
                     кров
                     тиск, проблеми з серцем або діабет, частіше розвиваються серйозні
                     хвороба.
                     Люди з лихоманкою, кашлем і утрудненим диханням повинні звернутися до лікаря
                     уваги.</p>
            </Panel>
            <Panel header="Як поширюється COVID-19?" key="3">
                <p>Люди можуть зловити COVID-19 від інших, у кого є вірус. Хвороба може поширитися
                     з
                     людина на людину через маленькі крапельки з носа чи рота, які розповсюджуються
                     коли
                     людина з COVID-19 кашляє або видихає. Ці краплі приземляються на предмети та
                     поверхні навколо особи. Потім інші люди ловлять COVID-19, торкаючись їх
                     предметів чи поверхонь, потім торкаючись їх очей, носа чи рота. Люди також можуть
                     виловити
                     COVID-19, якщо вони вдихають крапельки від людини з COVID-19, яка кашляє
                     або
                     видихає крапельки. Ось чому важливо триматися більше 1 метра (3 фути)
                     від людини, яка хворіє.

                     ВООЗ оцінює поточні дослідження щодо шляхів поширення та волі COVID-19
                     продовжувати
                     поділитися оновленими висновками. </p>
            </Panel>
            <Panel header="Чи може вірус, який викликає COVID-19, передаватися через повітря?"
                   key="4">
                <p>На сьогодні проведені дослідження свідчать, що в основному передається вірус, який викликає COVID-19
                     через контакт дихальних крапель, а не через повітря. Побачити
                     Попередній
                     відповідь на тему "Як поширюється COVID-19?"</p>
            </Panel>
            <Panel header="Чи можна зловити CoVID-19 від людини, яка не має симптомів?" key="5">
                <p>Основний спосіб поширення захворювання - через дихальні краплі, які виганяються
                     хтось
                     хто кашляє. Ризик підхопити COVID-19 у когось, у кого немає симптомів
                     всі
                     дуже низький. Однак у багатьох людей із COVID-19 спостерігаються лише легкі симптоми.
                     Це
                     особливо актуально на ранніх стадіях захворювання. Саме тому
                     можливо до
                     зловити COVID-19 від того, хто має, наприклад, лише легкий кашель і ні
                     почуватись хворим. ВООЗ проводить оцінку поточних досліджень періоду передачі
                     COVID-19 і продовжить ділитися оновленими висновками.</p>
            </Panel>
            <Panel header="Чи можу захворіти COVID-19 від контакту з фекаліями  когось із захворюванням?"
                   key="6">
                <p>Здається, ризик заразитися COVID-19 з фекаліями інфікованої людини
                     низький.
                     Хоча початкові дослідження дозволяють припустити, що у деяких вірусів може бути присутнім кал
                     випадки, що поширюються цим маршрутом, не є головною ознакою спалаху. Хто є
                     оцінка поточних досліджень щодо шляхів поширення та продовження COVID-19
                     поділитися
                     нові висновки. Оскільки це ризик, проте, це ще одна причина для чищення
                     руки
                     регулярно, після користування ванною і перед їжею.</p>
            </Panel>
            <Panel header="Чи є вакцина, препарат чи лікування від COVID-19?" key="7">
                <p>Ще ні. На сьогоднішній день не існує вакцини та специфічних противірусних препаратів
                    запобігти
                    або лікувати COVID-2019. Однак постраждалим слід опікуватися полегшенням
                    симптоми. Людей із серйозними захворюваннями слід госпіталізувати. Більшість пацієнтів
                    одужати
                    завдяки підтримуючій допомозі.

                    Можливі вакцини та деякі специфічні методи лікування наркотиками вивчаються.
                    Вони
                    проходять тестування через клінічні випробування. ВООЗ координує зусилля для розвитку
                    вакцини та лікарські засоби для профілактики та лікування COVID-19.

                    Найефективніші способи захистити себе та інших людей від COVID-19 - це
                    часто чистіть руки, прикривайте кашель вигином ліктя або тканини,
                    і
                    підтримувати відстань не менше 1 метра (3 фути) від людей, які кашляють або
                    чхання. (Див. Основні захисні заходи проти нового коронавірусу). </p>
            </Panel>
            <Panel header="Чи COVID-19 теж саме що і SARS?" key="8">
                <p>Ні. Вірус, який викликає COVID-19, і той, що спричинив спалах тяжких захворювань
                     Гострий респіраторний синдром (ГРВІ) 2003 року пов'язаний генетично один з одним,
                     але
                     захворювання, які вони викликають, зовсім інші.

                     ГРВІ була більш смертоносною, але набагато менш заразною, ніж COVID-19. Не було жодного
                     спалахи ГРВІ в будь-якій точці світу з 2003 року.</p>
            </Panel>
            <Panel header="Як довго вірус виживає на поверхні?" key="9">
                <p>Невідомо, як довго вірус, який викликає COVID-19, виживає на поверхні,
                     але
                     начебто поводиться, як і інші коронавіруси. Дослідження показують, що коронавіруси
                     (включаючи попередню інформацію про вірус COVID-19) може зберігатися
                     поверхонь
                     на кілька годин або до декількох днів. Це може відрізнятися за різних умов
                     (наприклад, тип поверхні, температура або вологість навколишнього середовища).

                     Якщо ви думаєте, що поверхня може бути заражена, очистіть її простим дезінфікуючим засобом
                     вбити
                     вірус і захистити себе та інших. Почистіть руки
                     на спиртовій основі
                     втирайте руки або мийте їх з милом. Не торкайтеся очей, рота чи
                     ніс.</p>
            </Panel>
        </Collapse>

        <div style={{marginTop: '10px'}}><Text>For more details check <a
            href="https://www.who.int/news-room/q-a-detail/q-a-coronaviruses">this link.</a></Text>
        </div>
    </Col>
};

export default QAPanel;
